import numpy as np
'''
[8397,8393,8389,8376,8378,8395,8411,8409,8406,8413,8408,8408,8414,8421,8411,8392,8404]
輸出：
民國108年1月銷售:8397
民國108年2月銷售:8393
民國108年3月銷售:8389
民國108年4月銷售:8376
民國108年5月銷售:8378
民國108年6月銷售:8395
民國108年7月銷售:8411
民國108年8月銷售:8409
民國108年9月銷售:8406
民國108年10月銷售:8413
民國108年11月銷售:8408
民國108年12月銷售:8408
民國109年1月銷售:8414
民國109年2月銷售:8421
民國109年3月銷售:8411
民國109年4月銷售:8392
民國109年5月銷售:8404
最大值為： 8421
最小值為： 8376
中位數為： 8406.0
平均值為： 8401.470588235294
'''

np_a = np.array([8397,8393,8389,8376,8378,8395,8411,8409,8406,8413,8408,8408,8414,8421,8411,8392,8404])
print(np_a)

# year = 108
# for i in range(1,len(np_a)):
#         for j in np_a:
#             print(f'民國{year}年{i}月銷售:{j}')
#             i += 1
#             if i > 12:
#                 i = 0
#                 i += 1
#                 year = 109
#         break
# max_ = np.max(np_a)
# min_ = np.min(np_a)
# median_ = np.median(np_a)
# mean_ = np.mean(np_a)
# print(f'''最大值為：{max_}
# 最小值為： {min_}
# 中位數為： {median_}
# 平均值為： {mean_}
# ''')

year = 108
month = 1
for j in np_a:
    print(f'民國{year}年{month}月銷售:{j}')
    month += 1
    if month > 12:
        month = 1
        year = 109

max_ = np.max(np_a)
min_ = np.min(np_a)
median_ = np.median(np_a)
mean_ = np.mean(np_a)
print(f'''最大值為：{max_}
最小值為：{min_}
中位數為：{median_}
平均值為：{mean_}
''')

